Revit 2027 API
BuiltInFailures.GenericMEPFailures.SegmentIsTooShort Property
 The segment is too short.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SegmentIsTooShort { get; }
Public Shared ReadOnly Property SegmentIsTooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SegmentIsTooShort {
	FailureDefinitionId^ get ();
}
static member SegmentIsTooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace